phoenix-rtos/phoenix-rtos-devices/multi/stm32l4-multi/xspi/xspi_n6.c
/*
 * Phoenix-RTOS
 *
 * STM32 XSPI Flash driver
 *
 * Copyright 2026 Phoenix Systems
 * Author: Jacek Maksymowicz
 *
 * This file is part of Phoenix-RTOS.
 *
 * %LICENSE%
 */

#include "xspi_n6.h"

#include <stdio.h>
#include <errno.h>
#include <stdbool.h>
#include <stdlib.h>
#include <string.h>
#include <sys/threads.h>
#include <sys/interrupt.h>
#include <sys/mman.h>
#include <sys/time.h>
#include <libmulti/libdma.h>

#include "../common.h"
#include "../stm32l4-multi.h"
#include "../ext_flash.h"
#include "mce.h"

#include <board_config.h>
#include <phoenix/arch/armv8m/stm32/flash_chip_setup.h>


/* clang-format off */
#define TRACE(fmt, ...) do { if (0) { printf("%s:%d: " fmt "\n", __func__, __LINE__, ##__VA_ARGS__); } } while (0)
#define LOG_ERROR(str, ...) do { fprintf(stderr, "%s:%d error: " str "\n", __func__, __LINE__, ##__VA_ARGS__); } while (0)
/* clang-format on */


#define XSPI1_REG_SIZE (256 * 1024 * 1024)
#define XSPI2_REG_SIZE (256 * 1024 * 1024)
#define XSPI3_REG_SIZE (256 * 1024 * 1024)

#define REGION_NOT_ENCRYPTED mce_regcount

enum {
	ipclk_sel_hclk5 = 0x0,
	ipclk_sel_per_ck = 0x1,
	ipclk_sel_ic3_ck = 0x2,
	ipclk_sel_ic4_ck = 0x3,
};


#define XSPI1_POS 0
#define XSPI2_POS (XSPI1_POS + XSPI1_STORAGE)
#define XSPI3_POS (XSPI2_POS + XSPI2_STORAGE)

#define N_XSPI_ACTIVE (XSPI1_STORAGE + XSPI2_STORAGE + XSPI3_STORAGE)

#define N_XSPI_CONTROLLERS 3

static unsigned int xspi_ctrlPos[N_XSPI_CONTROLLERS] = {
	(XSPI1_STORAGE != 0) ? XSPI1_POS : N_XSPI_ACTIVE,
	(XSPI2_STORAGE != 0) ? XSPI2_POS : N_XSPI_ACTIVE,
	(XSPI3_STORAGE != 0) ? XSPI3_POS : N_XSPI_ACTIVE,
};


static const xspi_ctrlParams_t xspi_ctrlParams[N_XSPI_ACTIVE] = {
#if XSPI1_STORAGE
	[XSPI1_POS] = {
		.start = XSPI1_REG_BASE,
		.size = XSPI1_REG_SIZE,
		.clksel = { .sel = pctl_ipclk_xspi1sel, .val = ipclk_sel_hclk5 },
		.divider_slow = 6,
		.divider = XSPI1_CLOCK_DIV,
		.dev = pctl_xspi1,
		.irq = xspi1_irq,
		.ctrl = XSPI1_BASE,
		.resetPin = { pctl_gpioo, 5 },
		.spiPort = XSPIM_PORT1,
		.chipSelect = XSPI_CHIPSELECT_NCS1,
		.isHyperbus = XSPI1_IS_HYPERBUS,
		.mceDev = pctl_mce1,
	},
#endif
#if XSPI2_STORAGE
	[XSPI2_POS] = {
		.start = XSPI2_REG_BASE,
		.size = XSPI2_REG_SIZE,
		.clksel = { .sel = pctl_ipclk_xspi2sel, .val = ipclk_sel_hclk5 },
		.divider_slow = 6,
		.divider = XSPI2_CLOCK_DIV,
		.dev = pctl_xspi2,
		.irq = xspi2_irq,
		.ctrl = XSPI2_BASE,
		.resetPin = { pctl_gpion, 12 },
		.spiPort = XSPIM_PORT2,
		.chipSelect = XSPI_CHIPSELECT_NCS1,
		.isHyperbus = XSPI2_IS_HYPERBUS,
		.mceDev = pctl_mce2,
	},
#endif
#if XSPI3_STORAGE
	[XSPI3_POS] = {
		.start = XSPI3_REG_BASE,
		.size = XSPI3_REG_SIZE,
		.clksel = { .sel = pctl_ipclk_xspi3sel, .val = ipclk_sel_hclk5 },
		.divider_slow = 6,
		.divider = XSPI3_CLOCK_DIV,
		.dev = pctl_xspi3,
		.irq = xspi3_irq,
		.ctrl = XSPI3_BASE,
		.resetPin = { -1, -1 },
		.spiPort = XSPIM_PORT2,
		.chipSelect = XSPI_CHIPSELECT_NCS1,
		.isHyperbus = XSPI3_IS_HYPERBUS,
		.mceDev = pctl_mce3,
	},
#endif
};


typedef struct {
	uint32_t ccr;
	uint32_t tcr;
	uint32_t ir;
} xspi_cmdRegs_t;


typedef struct {
	xspi_cmdRegs_t reg;
	uint32_t addr;
	uint32_t dataLen;
	uint8_t isRead;
} flash_opDefinition_t;


static struct {
	struct xspi_ctrlSetup {
		bool configured;
		handle_t mutex;
		handle_t irq;
		handle_t irq_mutex;
		handle_t irq_cond;
		const struct libdma_per *dma;
		struct xspi_mem {
			char name[32];
			uint8_t jedecID[6];
			uint8_t log_chipSize;
			uint8_t log_eraseSize;
			uint8_t log_pageSize;
			uint32_t eraseTimeoutMs;
			uint32_t chipEraseTimeoutMs;
			uint32_t writePageTimeoutUs;
			xspi_cmdRegs_t read;
			xspi_cmdRegs_t write;
			xspi_cmdRegs_t erase;
			flash_opDefinition_t chipErase;
			flash_opDefinition_t writeEnable;
			flash_opDefinition_t writeDisable;
			flash_opDefinition_t readStatus;
		} mem;
		mce_regionInfo_t region[mce_regcount];
	} ctrl[N_XSPI_ACTIVE];
} xspi_common;


static inline int getDevClk(int dev)
{
	platformctl_t pctl;
	pctl.action = pctl_get;
	pctl.type = pctl_devclk;
	pctl.devclk.dev = dev;
	if (platformctl(&pctl) < 0) {
		return 0;
	}

	return pctl.devclk.state;
}


/* Note: currently libphoenix doesn't implement pthread_rwlock*, so for now we use regular mutexes
 * to implement mutual exclusion.
 * If any additional actions need to be taken when switching controller modes, they can be
 * added to this function (maybe some way to prevent accesses to Flash?) */
static int xspi_rwlock_acquire(unsigned int idx, bool doWrite)
{
	(void)doWrite;
	return mutexLock(xspi_common.ctrl[idx].mutex);
}


static void xspi_rwlock_release(unsigned int idx)
{
	mutexUnlock(xspi_common.ctrl[idx].mutex);
}


static inline unsigned int xspi_lookupDevIdx(unsigned int devNum)
{
	if (devNum >= N_XSPI_CONTROLLERS) {
		return N_XSPI_ACTIVE;
	}

	unsigned int idx = xspi_ctrlPos[devNum];
	if (idx >= N_XSPI_ACTIVE) {
		return idx;
	}

	return xspi_common.ctrl[idx].configured ? idx : N_XSPI_ACTIVE;
}


/* -1 - address range crosses a region boundary
 * [0 .. (XSPI_MCE_REGIONS - 1)] - number of encrypted region
 *  REGION_NOT_ENCRYPTED - not encrypted
 */
static int xspi_getRegion(unsigned int idx, uint32_t off, size_t end)
{
	for (int i = 0; i < mce_regcount; i++) {
		mce_regionInfo_t *r = &xspi_common.ctrl[idx].region[i];
		if (!r->enabled) {
			continue;
		}

		if (((off < r->start) && (end > r->start)) || ((off < r->end) && (end > r->end))) {
			return -1;
		}

		if ((r->start <= off) && (end <= r->end)) {
			return i;
		}
	}

	return REGION_NOT_ENCRYPTED;
}


static int xspi_validateAndGetRegion(unsigned int idx, uint32_t off, size_t size)
{
	size_t fsize;
	size_t end = off + size;
	int region;

	if (end < off) {
		/* Integer overflow has occurred */
		return -EINVAL;
	}

	fsize = 1UL << xspi_common.ctrl[idx].mem.log_chipSize;
	if (!((off < fsize) && ((off + size) <= fsize))) {
		return -EINVAL;
	}

	region = xspi_getRegion(idx, off, end);
	if (region < 0) {
		return -EINVAL;
	}

	return region;
}


static inline void xspi_waitBusy(unsigned int idx)
{
	while ((*(xspi_ctrlParams[idx].ctrl + xspi_sr) & XSPI_SR_BUSY) != 0) {
		/* Wait for controller to become ready */
	}
}


/* Transfer data in indirect read or write mode using the FIFO.
 * `data`: output (if isRead == 0) or input (if isRead != 0) data buffer
 * `len`: length of data to transfer
 * `isRead`: == 0 if this is a write operation, != 0 otherwise */
static int xspi_transferFifo(unsigned int idx, uint8_t *data, size_t len, uint8_t isRead)
{
	const xspi_ctrlParams_t *p = &xspi_ctrlParams[idx];
	size_t i = 0, j = 0;
	uint32_t status;
	time_t deadline;

