phoenix-rtos/phoenix-rtos-devices/multi/stm32l4-multi/xspi/xspi_n6.c
	while (i < len) {
		status = *(p->ctrl + xspi_sr);
		/* Optimization - check status first, then calculate deadline.
		 * Because XSPI is very fast we can get bytes in FIFO within a few CPU clock cycles. */
		if ((status & (XSPI_SR_FTF | XSPI_SR_TCF)) == 0) {
			/* Timeout is very generous - at least 1 ms per byte. Device should never time out
			 * unless there is a hardware failure. */
			time_t now;
			gettime(&now, NULL);
			deadline = now + 1000;
			do {
				gettime(&now, NULL);
				status = *(p->ctrl + xspi_sr);
				if (now > deadline) {
					*(p->ctrl + xspi_cr) |= (1 << 1); /* Abort operation in progress */
					xspi_waitBusy(idx);
					return -ETIME;
				}
			} while ((status & (XSPI_SR_FTF | XSPI_SR_TCF)) == 0);
		}

		if (isRead != 0) {
			j = XSPI_FIFO_SIZE - ((status >> 8) & 0x7f);
			for (; j < XSPI_FIFO_SIZE && (i < len); j++, i++) {
				/* This controller allows byte and halfword reads from the XSPI_DR register */
				data[i] = *(volatile uint8_t *)(p->ctrl + xspi_dr);
			}
		}
		else {
			j = (status >> 8) & 0x7f;
			/* In indirect write mode, writing data triggers the operation */
			for (; j < XSPI_FIFO_SIZE && (i < len); j++, i++) {
				/* This controller allows byte and halfword writes to the XSPI_DR register */
				*(volatile uint8_t *)(p->ctrl + xspi_dr) = data[i];
			}
		}
	}

	while ((*(p->ctrl + xspi_sr) & XSPI_SR_TCF) == 0) {
		/* Wait for transfer completion */
	}

	*(p->ctrl + xspi_fcr) = XSPI_SR_TCF;
	return EOK;
}


static inline int xspi_opHasAddr(const flash_opDefinition_t *opDef)
{
	return ((opDef->reg.ccr >> 8) & 0x7) != 0;
}


static uint32_t xspi_changeCtrlMode(unsigned int idx, uint32_t new_mode, int doMemWriting)
{
	const xspi_ctrlParams_t *p = &xspi_ctrlParams[idx];
	struct xspi_mem *mem = &xspi_common.ctrl[idx].mem;
	uint32_t prev_mode, v;

	v = *(p->ctrl + xspi_cr);
	prev_mode = (v & XSPI_CR_MODE_MASK);
	if (prev_mode == new_mode) {
		return prev_mode;
	}

	if ((prev_mode == XSPI_CR_MODE_MEMORY) || (prev_mode == XSPI_CR_MODE_AUTOPOLL)) {
		dataBarier();
		*(p->ctrl + xspi_cr) = v | (1 << 1); /* Abort operation in progress */
		xspi_waitBusy(idx);
	}

	v &= ~XSPI_CR_MODE_MASK;
	if (new_mode == XSPI_CR_MODE_MEMORY) {
		*(p->ctrl + xspi_cr) = v;
		dataBarier();
		xspi_waitBusy(idx);

		*(p->ctrl + xspi_ccr) = mem->read.ccr;
		*(p->ctrl + xspi_tcr) = mem->read.tcr;
		*(p->ctrl + xspi_ir) = mem->read.ir;
		/* Clear prefetch and timeout bits */
		v &= ~(XSPI_CR_NOPREF_AXI | XSPI_CR_NOPREF | XSPI_CR_TCEN);
		if (doMemWriting != 0) {
			*(p->ctrl + xspi_wccr) = mem->write.ccr;
			*(p->ctrl + xspi_wtcr) = mem->write.tcr;
			*(p->ctrl + xspi_wir) = mem->write.ir;
			/* Leave prefetch and timeout bits cleared to enable prefetch and disable timeout */
		}
		else {
			/* Disable writing. Attempting to write will cause an exception. */
			*(p->ctrl + xspi_wccr) = 0;
			v |= XSPI_DEFAULT_PREFETCH | XSPI_DEFAULT_TIMEOUT;
		}

		dataBarier();
	}

	v |= new_mode;
	*(p->ctrl + xspi_cr) = v;
	xspi_waitBusy(idx);

	/* Clear any flags that may have been set (e.g. in autopoll or memory-mapped mode) */
	*(p->ctrl + xspi_fcr) = XSPI_SR_TCF | XSPI_SR_SMF;
	return prev_mode;
}


static int xspi_performOp(unsigned int idx, const flash_opDefinition_t *opDef, unsigned char *data)
{
	const xspi_ctrlParams_t *p = &xspi_ctrlParams[idx];
	xspi_changeCtrlMode(idx, (opDef->isRead != 0) ? XSPI_CR_MODE_IREAD : XSPI_CR_MODE_IWRITE, 0);
	if (opDef->dataLen != 0) {
		*(p->ctrl + xspi_dlr) = opDef->dataLen - 1;
	}

	*(p->ctrl + xspi_ccr) = opDef->reg.ccr;
	*(p->ctrl + xspi_tcr) = opDef->reg.tcr;
	/* If indirect read mode and no address, this write triggers the operation */
	*(p->ctrl + xspi_ir) = opDef->reg.ir;
	if (xspi_opHasAddr(opDef)) {
		/* If indirect read mode with address, this write triggers the operation */
		*(p->ctrl + xspi_ar) = opDef->addr;
	}

	return xspi_transferFifo(idx, data, opDef->dataLen, opDef->isRead);
}


static int xspi_waitForWriteCompletion(unsigned int idx, const flash_opDefinition_t *opDef, time_t timeout_us)
{
	int ret = 0;
	const xspi_ctrlParams_t *p = &xspi_ctrlParams[idx];
	struct xspi_ctrlSetup *s = &xspi_common.ctrl[idx];

	xspi_changeCtrlMode(idx, XSPI_CR_MODE_AUTOPOLL, 0);
	*(p->ctrl + xspi_psmkr) = 0x01; /* Check bit 0 */
	*(p->ctrl + xspi_psmar) = 0x00; /* Check until it's cleared */
	*(p->ctrl + xspi_pir) = 0x10;
	*(p->ctrl + xspi_dlr) = opDef->dataLen - 1;
	*(p->ctrl + xspi_ccr) = opDef->reg.ccr;
	*(p->ctrl + xspi_tcr) = opDef->reg.tcr;
	/* If command has no address, writing XSPI_IR starts the operation */
	*(p->ctrl + xspi_ir) = opDef->reg.ir;
	if (xspi_opHasAddr(opDef)) {
		/* If command has address, writing XSPI_AR starts the operation */
		*(p->ctrl + xspi_ar) = opDef->addr;
	}

	mutexLock(s->irq_mutex);
	*(p->ctrl + xspi_cr) |= XSPI_CR_SMIE;
	time_t now, end;
	gettime(&now, NULL);
	end = now + timeout_us;
	while (1) {
		condWait(s->irq_cond, s->irq_mutex, timeout_us);
		if ((*(p->ctrl + xspi_sr) & XSPI_SR_SMF) != 0) {
			break;
		}

		gettime(&now, NULL);
		if (end <= now) {
			*(p->ctrl + xspi_cr) |= (1 << 1); /* Abort auto-polling */
			ret = -ETIME;
			break;
		}
	}

	mutexUnlock(s->irq_mutex);
	*(p->ctrl + xspi_fcr) = XSPI_SR_SMF;
	return ret;
}


static int xspi_writeEnable(unsigned int idx, bool enable)
{
	/* Depending on command status may be 1 or 2 bytes long.
	 * We only care about the first byte, but need to allocate a large enough buffer. */
	uint8_t status[2];
	const flash_opDefinition_t *opDef =
			enable ?
			&xspi_common.ctrl[idx].mem.writeEnable :
			&xspi_common.ctrl[idx].mem.writeDisable;
	unsigned retries = 10;
	int ret;
	enable = (enable != 0) ? 1 : 0;

	/* Set flag and verify until it's set - required according to Macronix datasheet */
	do {
		if (retries == 0) {
			return -EIO;
		}

		retries--;
		ret = xspi_performOp(idx, opDef, NULL);
		if (ret < 0) {
			return ret;
		}

		ret = xspi_performOp(idx, &xspi_common.ctrl[idx].mem.readStatus, status);
		if (ret < 0) {
			return ret;
		}
	} while (((status[0] >> 1) & 1) != enable);

	return EOK;
}


