phoenix-rtos/phoenix-rtos-devices/multi/stm32l4-multi/xspi/xspi_n6.c
/* Perform a write-like operation (program or erase) */
static ssize_t xspi_performWriteOp(
		unsigned int idx,
		const flash_opDefinition_t *opDef,
		const void *data,
		time_t timeout_us)
{
	int ret;
	if (xspi_writeEnable(idx, 1) < 0) {
		return -EIO;
	}

	ret = xspi_performOp(idx, opDef, (void *)data);
	if (ret < 0) {
		return ret;
	}

	return xspi_waitForWriteCompletion(idx, &xspi_common.ctrl[idx].mem.readStatus, timeout_us);
}


static int xspi_invalCache(const void *addr, size_t sz)
{
	platformctl_t pctl;
	pctl.action = pctl_set;
	pctl.type = pctl_invalDCache;
	pctl.opDCache.addr = (void *)addr;
	pctl.opDCache.sz = sz;
	return platformctl(&pctl);
}


static int xspi_dmaWrite(const struct libdma_per *per, void *dst, const void *src, size_t len)
{
	int ret = 0;
	/* Here we optimize the transfer - we pick a maximum data width for both source and destination
	 * depending on pointer alignment and transfer length (up to 8 bytes).
	 * Transfer length must be a multiple of burst length and AXI supports max 16 data units.
	 * If MCE is in block mode we assume that destination and length are multiples of 16
	 * (it should have been verified previously), so logDat_dst == 3, burst_dst == 2.
	 */
	size_t logDat_dst = min(__builtin_ctz((addr_t)dst | len), 3);
	size_t logDat_src = min(__builtin_ctz((addr_t)src | len), 3);
	size_t logBurst = min(__builtin_ctz(len), 4);
	/* Calculate how many data units are to a burst. */
	uint8_t burst_src = 1U << (logBurst - logDat_src);
	uint8_t burst_dst = 1U << (logBurst - logDat_dst);

	libdma_peripheral_config_t cfg = {
		.addr = dst,
		.elSize_log = logDat_dst,
		.burstSize = burst_dst,
		.increment = 1,
	};

	libdma_transfer_buffer_t bufs[2];
	bufs[0] = (libdma_transfer_buffer_t) {
		.buf = (void *)src,
		.bufSize = len,
		.elSize_log = logDat_src,
		.burstSize = burst_src,
		.increment = 1,
		.isCached = 1,
		/* Packed mode ensures the same byte sequence will result regardless of source/destination element size. */
		.transform = LIBXPDMA_TRANSFORM_PACK,
	};
	size_t nBufs = 1;

	/* If ending is misaligned, handle the write-end bug */
	void *end = dst + len;
	uint32_t misalign = 4 - ((addr_t)end % 4);
	uint8_t misalignData[4];
	if (misalign < 4) {
		/* This read must occur before any writes */
		memcpy(misalignData, end, misalign);
		bufs[1] = (libdma_transfer_buffer_t) {
			.buf = (void *)misalignData,
			.bufSize = misalign,
			.elSize_log = 0,
			.burstSize = 1,
			.increment = 1,
			.isCached = 1,
			.transform = LIBXPDMA_TRANSFORM_PACK,
		};
		nBufs = 2;
	}

	ret = (ret < 0) ? ret : libxpdma_configurePeripheral(per, dma_mem2per, &cfg);
	ret = (ret < 0) ? ret : libxpdma_configureMemory(per, dma_mem2per, 0, bufs, nBufs);
	/* Because XSPI transfer is very fast, it's faster to wait through polling only
	 * (no overhead caused by syscalls/ISR/scheduler etc.) */
	ret = (ret < 0) ? ret : libxpdma_startTransferPollingOnly(per, dma_mem2per);
	ret = (ret < 0) ? ret : libxpdma_waitPoll(per, dma_mem2per, 0);
	ret = (ret < 0) ? ret : xspi_invalCache(dst, len);
	return ret;
}


static int xspi_isr(unsigned int irq, void *arg)
{
	unsigned int idx = (unsigned int)arg;
	uint32_t status = *(xspi_ctrlParams[idx].ctrl + xspi_sr);
	status &= (XSPI_SR_TOF | XSPI_SR_SMF | XSPI_SR_FTF | XSPI_SR_TCF | XSPI_SR_TEF);
	*(xspi_ctrlParams[idx].ctrl + xspi_cr) &= ~(status << 16);
	return 1;
}


static void xspi_chipSetup_copyCmdRegs(xspi_cmdRegs_t *mem, flashcs_regs_v1_t *cs)
{
	mem->ccr = (uint32_t)cs->ccr;
	mem->tcr = (uint32_t)cs->tcr;
	mem->ir = (uint32_t)cs->ir;
}


static void xspi_chipSetup_deserialize(unsigned int idx, flashcs_v1_basic_t *cs)
{
	struct xspi_mem *mem = &xspi_common.ctrl[idx].mem;
	mem->log_chipSize = (uint8_t)cs->log_chipSize;
	mem->log_eraseSize = (uint8_t)cs->log_eraseSize;
	mem->log_pageSize = (uint8_t)cs->log_pageSize;
	mem->eraseTimeoutMs = (uint32_t)cs->eraseTimeoutMs;
	mem->chipEraseTimeoutMs = (uint32_t)cs->chipEraseTimeoutMs;
	mem->writePageTimeoutUs = (uint32_t)cs->writePageTimeoutUs;
	strncpy(mem->name, cs->name, min(sizeof(mem->name), sizeof(cs->name)));
	mem->name[sizeof(mem->name) - 1] = '\0';
	memcpy(mem->jedecID, cs->jedecID, sizeof(mem->jedecID));
	xspi_chipSetup_copyCmdRegs(&mem->read, &cs->read);
	xspi_chipSetup_copyCmdRegs(&mem->write, &cs->write);
	xspi_chipSetup_copyCmdRegs(&mem->erase, &cs->erase);

	xspi_chipSetup_copyCmdRegs(&mem->chipErase.reg, &cs->chipErase);
	mem->chipErase.addr = 0;
	mem->chipErase.dataLen = 0;
	mem->chipErase.isRead = 0;

	xspi_chipSetup_copyCmdRegs(&mem->writeEnable.reg, &cs->writeEnable);
	mem->writeEnable.addr = 0;
	mem->writeEnable.dataLen = 0;
	mem->writeEnable.isRead = 0;

	xspi_chipSetup_copyCmdRegs(&mem->writeDisable.reg, &cs->writeDisable);
	mem->writeDisable.addr = 0;
	mem->writeDisable.dataLen = 0;
	mem->writeDisable.isRead = 0;

	xspi_chipSetup_copyCmdRegs(&mem->readStatus.reg, &cs->readStatus);
	mem->readStatus.addr = (uint32_t)cs->readStatus_addr;
	mem->readStatus.dataLen = (uint8_t)cs->readStatus_dataLen;
	mem->readStatus.isRead = 1;
}


static int xspi_chipSetup_lookupSyspage(const char *name, void **data, size_t *size)
{
	int progsz = syspageprog(NULL, -1);
	if (progsz < 0) {
		return -ENOENT;
	}

	for (int i = 0; i < progsz; i++) {
		syspageprog_t prog;
		if (syspageprog(&prog, i) != 0) {
			continue;
		}

		if (strcmp(prog.name, name) == 0) {
			*data = (void *)prog.addr;
			*size = prog.size;
			return EOK;
		}
	}

	return -ENOENT;
}


static int xspi_chipSetup_readSyspage(unsigned int idx)
{
	char memconfig_path[32];
	unsigned int portNum;
	switch (xspi_ctrlParams[idx].spiPort) {
		case XSPIM_PORT1: portNum = 1; break;
		case XSPIM_PORT2: portNum = 2; break;
		default: return -EINVAL;
	}

	int ret = snprintf(memconfig_path, sizeof(memconfig_path), FLASHCS_FORMAT, portNum);
	if (ret >= sizeof(memconfig_path)) {
		return -ENAMETOOLONG;
	}

	void *data;
	size_t size;
	ret = xspi_chipSetup_lookupSyspage(memconfig_path, &data, &size);
	if (ret < 0) {
		return ret;
	}

	flashcs_v1_header_t *hdr = data;
	flashcs_v1_basic_t *cs = data + sizeof(*hdr);
	size_t expectedSize = sizeof(*hdr) + sizeof(*cs);
	if (size < expectedSize) {
		return -ENOTSUP;
	}

