phoenix-rtos/phoenix-rtos-devices/multi/stm32l4-multi/xspi/xspi_n6.c
	if ((hdr->version != FLASHCS_VER_1) || ((hdr->features & FLASHCS_FEAT_BASIC) == 0)) {
		return -ENOTSUP;
	}

	xspi_chipSetup_deserialize(idx, cs);
	return EOK;
}


static int xspi_initOne(unsigned int idx)
{
	const xspi_ctrlParams_t *p = &xspi_ctrlParams[idx];
	struct xspi_ctrlSetup *s = &xspi_common.ctrl[idx];
	if (s->configured) {
		TRACE("already initialized");
		return -EALREADY;
	}

	/* Currently we don't have support for Hyperbus Flash devices */
	if (p->isHyperbus != 0) {
		return -ENOTSUP;
	}

	if (getDevClk(p->dev) == 0) {
		/* Device disabled; sometime we may add support for initialization from scratch */
		TRACE("not initialized");
		return -EIO;
	}

	uint32_t crValue = *(p->ctrl + xspi_cr);
	if (((crValue & 1) == 0) || ((crValue & XSPI_CR_MODE_MASK) != XSPI_CR_MODE_MEMORY)) {
		/* Device not configured; sometime we may add support for initialization from scratch */
		TRACE("not initialized");
		return -EIO;
	}

	for (int i = 0; i < mce_regcount; i++) {
		if (mce_getRegionSetup(xspi_ctrlParams[idx].mceDev, i, &xspi_common.ctrl[idx].region[i]) < 0) {
			xspi_common.ctrl[idx].region[i].enabled = false;
		}
	}

	/* Controller is already initialized and in memory-mapped mode. */
	int ret = xspi_chipSetup_readSyspage(idx);
	if (ret < 0) {
		LOG_ERROR("XSPI configuration read error %d", ret);
		return ret;
	}

	if (s->mem.log_chipSize > 31) {
		LOG_ERROR("Chip has size over 2 GB - full capacity not supported");
		s->mem.log_chipSize = 31;
	}

	if ((1UL << s->mem.log_chipSize) > p->size) {
		LOG_ERROR("Chip has size larger than memory map - full capacity not supported");
		s->mem.log_chipSize = __builtin_ctz(p->size);
	}

	/* Perform some sanity checks on the info that was read */
	if ((s->mem.log_eraseSize > s->mem.log_chipSize) || (s->mem.log_pageSize > s->mem.log_chipSize)) {
		return -EINVAL;
	}

	const struct libdma_per *per;
	ret = libxpdma_acquirePeripheral(dma_memTransfer, memTransfer_perIsDst, LIBXPDMA_ACQUIRE_2D_MEM2PER, &per);
	if (ret < 0) {
		TRACE("DMA acquire %d", ret);
		return ret;
	}

	ret = libxpdma_configureChannel(per, dma_mem2per, dma_priorityVeryHigh, NULL);
	if (ret < 0) {
		TRACE("DMA configure %d", ret);
		return ret;
	}

	s->dma = per;

	if (mutexCreate(&s->mutex) < 0) {
		return -ENOMEM;
	}

	if (mutexCreate(&s->irq_mutex) < 0) {
		resourceDestroy(s->mutex);
		return -ENOMEM;
	}

	if (condCreate(&s->irq_cond) < 0) {
		resourceDestroy(s->mutex);
		resourceDestroy(s->irq_mutex);
		return -ENOMEM;
	}

	if (interrupt(p->irq, xspi_isr, (void *)idx, s->irq_cond, &s->irq) < 0) {
		resourceDestroy(s->mutex);
		resourceDestroy(s->irq_mutex);
		resourceDestroy(s->irq_cond);
		return -ENOMEM;
	}

	s->configured = true;
	return EOK;
}


int extFlash_fn_init(void)
{
	memset(&xspi_common, 0, sizeof(xspi_common));
	for (unsigned int devNum = 0; devNum < N_XSPI_CONTROLLERS; devNum++) {
		unsigned int idx = xspi_ctrlPos[devNum];
		if (idx >= N_XSPI_ACTIVE) {
			continue;
		}

		xspi_initOne(idx);
	}

	return EOK;
}


ssize_t extFlash_fn_read(unsigned int devNum, addr_t offs, void *buff, size_t len)
{
	unsigned int idx = xspi_lookupDevIdx(devNum);
	if (idx >= N_XSPI_ACTIVE) {
		return -ENODEV;
	}

	int region = xspi_validateAndGetRegion(idx, offs, len);
	if (region < 0) {
		return region;
	}

	if (len == 0) {
		return 0;
	}

	if (xspi_rwlock_acquire(idx, false) < 0) {
		return -EBUSY;
	}

	/* TODO: for large reads consider using mem-to-mem DMA transfer - it may free up CPU for other tasks */
	memcpy(buff, xspi_ctrlParams[idx].start + offs, len);
	xspi_rwlock_release(idx);
	return len;
}


static int xspi_write_page(unsigned int idx, void *dest, const void *src, size_t *i, size_t n)
{
	struct xspi_mem *mem = &xspi_common.ctrl[idx].mem;
	int ret;
	ret = xspi_writeEnable(idx, 1);
	if (ret < 0) {
		return ret;
	}

	xspi_changeCtrlMode(idx, XSPI_CR_MODE_MEMORY, 1);
	ret = xspi_dmaWrite(xspi_common.ctrl[idx].dma, dest + *i, src + *i, n);
	if (ret < 0) {
		return ret;
	}

	ret = xspi_waitForWriteCompletion(idx, &mem->readStatus, mem->writePageTimeoutUs);
	if (ret < 0) {
		return ret;
	}

	*i += n;
	return 0;
}


static ssize_t xspi_write_internal(unsigned int idx, addr_t offs, const void *buff, size_t len)
{
	const xspi_ctrlParams_t *p = &xspi_ctrlParams[idx];
	/* Limit page size to 32 KB (DMA supports 65535 B max) */
	size_t page_size = 1UL << min(xspi_common.ctrl[idx].mem.log_pageSize, 15);

	size_t i = 0;
	int ret;

	if ((offs % page_size) != 0) {
		ret = xspi_write_page(idx, p->start + offs, buff, &i, min(page_size - (offs % page_size), len));
		if (ret < 0) {
			return ret;
		}
	}

	while ((len - i) >= page_size) {
		ret = xspi_write_page(idx, p->start + offs, buff, &i, page_size);
		if (ret < 0) {
			return ret;
		}
	}

	if ((len - i) > 0) {
		ret = xspi_write_page(idx, p->start + offs, buff, &i, len - i);
		if (ret < 0) {
			return ret;
		}
	}

	return (ssize_t)i;
}


ssize_t extFlash_fn_write(unsigned int devNum, addr_t offs, const void *buff, size_t len)
{
	unsigned int idx = xspi_lookupDevIdx(devNum);
	if (idx >= N_XSPI_ACTIVE) {
		return -ENODEV;
	}

	int region = xspi_validateAndGetRegion(idx, offs, len);
	if (region < 0) {
		return region;
	}

	if (region != REGION_NOT_ENCRYPTED) {
		size_t granularity = xspi_common.ctrl[idx].region[region].granularity;
		if (granularity > 1) {
			if (((offs % granularity) != 0) || ((len % granularity) != 0)) {
				return -EINVAL;
			}
		}
	}

	if (len == 0) {
		return 0;
	}

	if (xspi_rwlock_acquire(idx, true) < 0) {
		return -EBUSY;
	}

	uint32_t prev_mode = xspi_changeCtrlMode(idx, XSPI_CR_MODE_IWRITE, 0);
	ssize_t ret = xspi_write_internal(idx, offs, buff, len);
	xspi_changeCtrlMode(idx, prev_mode, 0);
	xspi_invalCache(xspi_ctrlParams[idx].start + offs, len);
	xspi_rwlock_release(idx);
	return ret;
}


static ssize_t xspi_erase_internal(unsigned int idx, addr_t offs, size_t len)
{
	flash_opDefinition_t op;
	size_t eraseSize = 1UL << xspi_common.ctrl[idx].mem.log_eraseSize;
	ssize_t len_ret = (ssize_t)len;
	op.reg = xspi_common.ctrl[idx].mem.erase;
	op.isRead = 0;
	op.dataLen = 0;
	for (; len != 0; offs += eraseSize, len -= eraseSize) {
		op.addr = offs;
		int ret = xspi_performWriteOp(
				idx,
				&op,
				NULL,
				(time_t)xspi_common.ctrl[idx].mem.eraseTimeoutMs * 1000);
		if (ret < 0) {
			return ret;
		}
	}

