phoenix-rtos/phoenix-rtos-devices/multi/stm32l4-multi/xspi/xspi_n6.c
	return (ssize_t)len_ret;
}


ssize_t extFlash_fn_erase(unsigned int devNum, addr_t offs, size_t len)
{
	unsigned int idx = xspi_lookupDevIdx(devNum);
	if (idx >= N_XSPI_ACTIVE) {
		return -ENODEV;
	}

	int region = xspi_validateAndGetRegion(idx, offs, len);
	if (region < 0) {
		return region;
	}

	size_t eraseSize = 1UL << xspi_common.ctrl[idx].mem.log_eraseSize;
	if (((offs % eraseSize) != 0) || ((len % eraseSize) != 0)) {
		return -EINVAL;
	}

	if (xspi_rwlock_acquire(idx, true) < 0) {
		return -EBUSY;
	}

	uint32_t prev_mode = xspi_changeCtrlMode(idx, XSPI_CR_MODE_IWRITE, 0);
	ssize_t ret = xspi_erase_internal(idx, offs, len);
	xspi_changeCtrlMode(idx, prev_mode, 0);
	xspi_invalCache(xspi_ctrlParams[idx].start + offs, len);
	xspi_rwlock_release(idx);
	return ret;
}


int extFlash_fn_chipErase(unsigned int devNum)
{
	unsigned int idx = xspi_lookupDevIdx(devNum);
	if (idx >= N_XSPI_ACTIVE) {
		return -ENODEV;
	}

	if (xspi_rwlock_acquire(idx, true) < 0) {
		return -EBUSY;
	}

	uint32_t prev_mode = xspi_changeCtrlMode(idx, XSPI_CR_MODE_IWRITE, 0);
	int ret = xspi_performWriteOp(
			idx,
			&xspi_common.ctrl[idx].mem.chipErase,
			NULL,
			(time_t)xspi_common.ctrl[idx].mem.chipEraseTimeoutMs * 1000);
	xspi_changeCtrlMode(idx, prev_mode, 0);
	xspi_invalCache(xspi_ctrlParams[idx].start, (1UL << xspi_common.ctrl[idx].mem.log_chipSize));
	xspi_rwlock_release(idx);
	return ret;
}


int extFlash_fn_sync(unsigned int devNum)
{
	unsigned int idx = xspi_lookupDevIdx(devNum);
	if (idx >= N_XSPI_ACTIVE) {
		return -ENODEV;
	}

	if (xspi_rwlock_acquire(idx, false) < 0) {
		return -EBUSY;
	}

	xspi_invalCache(xspi_ctrlParams[idx].start, (1UL << xspi_common.ctrl[idx].mem.log_chipSize));
	xspi_rwlock_release(idx);
	return EOK;
}


int extFlash_fn_getInfo(unsigned int devNum, extFlashDef_t *info)
{
	TRACE("%u", devNum);
	info->nDevices = N_XSPI_CONTROLLERS;
	unsigned int idx = xspi_lookupDevIdx(devNum);
	if (idx >= N_XSPI_ACTIVE) {
		return -ENODEV;
	}

	/* No locking required - there are no interactions with memory. */
	struct xspi_ctrlSetup *s = &xspi_common.ctrl[idx];
	strncpy(info->name, s->mem.name, sizeof(info->name));
	info->name[sizeof(info->name) - 1] = '\0';
	info->eraseSize = (1UL << s->mem.log_eraseSize);
	/* We report the maximum granularity of all regions as the write size.
	 * This is not optimal, but safe. */
	unsigned int maxGranularity = 1; /* writeSize must be at least 1 */
	for (int i = 0; i < mce_regcount; i++) {
		if (s->region[i].enabled) {
			maxGranularity = max(s->region[i].granularity, maxGranularity);
		}
	}

	info->writeSize = maxGranularity;
	info->pageSize = (1UL << s->mem.log_pageSize);
	info->totalSize = (1UL << s->mem.log_chipSize);
	return EOK;
}
